In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [3]:
#Display top 3 rows
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [5]:
#Check last 3 rows
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [9]:
#to get the shape (rows and columns)
df1.shape
print("Number of rows: ",df1.shape[0])
print("Number of columns: ",df1.shape[1])

Number of rows:  7
Number of columns:  3

In [7]:
#Get informations abput dataset like total number of rows, columns, data type of each column and memory requirement
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [12]:
#check null values
df1.isnull()
#sum of null values
df1.isnull().sum()
#sum of null values row wise
df1.isnull().sum(axis=1) #axis=0 for column wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [15]:
#overall statistics 
df1.describe() #by default displays stats of a numerical column
df1.describe(include='all') #include for all columns

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [19]:
#to get unique genders
df1['Gender'].unique()
#to get number of unique values
df1['Gender'].nunique()

2

In [21]:
#count of unique values in gender column
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [23]:
#total number of students having marks b/w 90 to 100 using operator 
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [24]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [25]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [26]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [27]:
#total number of students having marks b/w 90 to 100 using between (inclusive) 
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [28]:
sum(df1['Marks'].between(90,100))

4

In [29]:
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [31]:
#Find Average marks 
df1['Marks'].mean()

92.14285714285714

In [32]:
#Find min marks
df1['Marks'].min()

83

In [34]:
#Find max marks
df1['Marks'].max()

99

In [36]:
#Appply method can be used for custom functions 
def marks(x):
    return x/2

df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [38]:
df1['Half Marks']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [39]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [40]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [45]:
#Map Function eg. Male to 1 and Female to 0
df1['Gender'].map({'Male':1, 'Female':0})
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})
df1

      Name  Marks  Gender  Half Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [ ]:
#Drop column 
df1.drop('Male_Female', axis=1)

In [52]:
#Drop columns > Pass a list
df1.drop(['Half Marks', 'Male_Female'], axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [53]:
#Drop columns changing the present table permanently 
df1.drop(['Half Marks', 'Male_Female'], axis=1, inplace=True)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [54]:
#Print column names
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [56]:
#Display Index of rows
df1.index

RangeIndex(start=0, stop=7, step=1)

In [58]:
#Sort dataframe as per marks
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [67]:
#Display name and marks of female students
df1[df1['Gender']=='Female']['Name']

1     Aadhya
2     Krisha
5     Mittal
6    Archana
Name: Name, dtype: object

In [68]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [71]:
df1['Gender'].isin(['Female'])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [72]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99